# CanAddExternallyTaggedNonBRep Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternallyTaggedNonBReps..::..CanAddExternallyTaggedNonBRep Method
ExternallyTaggedNonBReps Class See Also
---
Checks if the input geometry could be added to this collection or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool CanAddExternallyTaggedNonBRep(
	ExternallyTaggedNonBRep geometry
)
```

Visual Basic
---
```text
Public Function CanAddExternallyTaggedNonBRep ( _
	geometry As ExternallyTaggedNonBRep _
) As Boolean
```

Visual C++
---
```text
public:
bool CanAddExternallyTaggedNonBRep(
	ExternallyTaggedNonBRep^ geometry
)
```

# ### Parameters
geometry
    Type: Autodesk.Revit.DB..::..ExternallyTaggedNonBRep
# ### Return Value
True if we can add the input geometry to this collection, false otherwise.
# Remarks
Duplicate ExternalGeometryIds are prohibited.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace